# SQL questions - regression

(Use sub-queries or views, wherever necessary)

1. Create a database called `house_price_regression`.
2. Create a table `house_price_data` with the same columns as given in the csv file. Please make sure you use the correct data types for the columns. You can find the names of the headers for the table in the `regression_data.xls` file. Use the same column names as the names in the excel file. Please make sure you use the correct data types for each of the columns.

3. Import the data from the csv file into the table. Before you import the data into the empty table, make sure that you have deleted the headers from the csv file. (in this case, we have already deleted the header names from the csv files).  To not modify the original data, if you want you can create a copy of the csv file as well. Note you might have to use the following queries to give permission to SQL to import data from csv files in bulk:

    ```sql
    SHOW VARIABLES LIKE 'local_infile'; -- This query would show you the status of the variable ‘local_infile’. If it is off, use the next command, otherwise you should be good to go

    SET GLOBAL local_infile = 1;
    ```

4.  Select all the data from table `house_price_data` to check if the data was imported correctly.
5.  Use the alter table command to drop the column `date` from the database, as we would not use it in the analysis with SQL. Select all the data from the table to verify if the command worked. Limit your returned results to 10.
6.  Use sql query to find how many rows of data you have.
7.  Now we will try to find the unique values in some of the categorical columns:

    - What are the unique values in the column `bedrooms`?
    - What are the unique values in the column `bathrooms`?
    - What are the unique values in the column `floors`?
    - What are the unique values in the column `condition`?
    - What are the unique values in the column `grade`?

8.  Arrange the data in decreasing order by the price of the house. Return only the IDs of the top 10 most expensive houses in your data.
9.  What is the average price of all the properties in your data?
10. In this exercise we will use a simple "group by" to check the properties of some of the categorical variables in our data

    - What is the average price of the houses grouped by bedrooms? The returned result should have only two columns, bedrooms and Average of the prices. Use an alias to change the name of the second column.
    - What is the average `sqft_living` of the houses grouped by bedrooms? The returned result should have only two columns, bedrooms and an average of the `sqft_living`. Use an alias to change the name of the second column.
    - What is the average price of the houses with a waterfront and without a waterfront? The returned result should have only two columns, waterfront and `Average` of the prices. Use an alias to change the name of the second column.
    - Is there any correlation between the columns `condition` and `grade`? You can analyze this by grouping the data by one of the variables and then aggregating the results of the other column. Visually check if there is a positive correlation or negative correlation or no correlation between the variables.

        You might also have to check the number of houses in each category (ie number of houses for a given `condition`) to assess if that category is well represented in the dataset to include it in your analysis. For eg. If the category is under-represented as compared to other categories, ignore that category in this analysis

11. One of the customers is only interested in the following houses:

    - Number of bedrooms - either 3 or 4
    - Bathrooms - more than 3
    - One Floor
    - No waterfront
    - Condition should be 3 at least
    - Grade should be 5 at least
    - Price less than 300000

    For the rest of the things, they are not too concerned. Write a simple query to find what are the options available for them.

12. Your manager wants to find out the list of properties whose prices are twice more than the average of all the properties in the database. Write a query to show them the list of such properties. You might need to use a subquery for this problem.
13. Since this is something that the senior management is regularly interested in, create a view called `Houses_with_higher_than_double_average_price` of the same query.
14. Most customers are interested in properties with three or four bedrooms. What is the difference in average prices of the properties with three and four bedrooms? In this case, you can simply use a group by to check the prices for those particular houses.
15. What are the different locations where properties are available in your database? (distinct zip codes)
16. Show the list of all the properties that were renovated.
17. Provide the details of the property that is the 11th most expensive property in your database.

In [11]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass



password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila?charset=utf8&local_infile=1'
engine = create_engine(connection_string)
%reload_ext sql
%sql {connection_string}

 ··········

# 1.

In [12]:
%%sql
use house_price_regression_new;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
0 rows affected.

[]

# 2.

In [13]:
%%sql
    drop table if exists house_price_data;
    CREATE TABLE house_price_data (
    `id` int(11) NOT NULL,
    `date` date DEFAULT NULL,
    `bedrooms` int(4) DEFAULT NULL,
    `bathrooms` float DEFAULT NULL,
    `sqft_living` float DEFAULT NULL,
    `sqft_lot` float DEFAULT NULL,
    `floors` int(4) DEFAULT NULL,
    `waterfront` int(4) DEFAULT NULL,
    `view` int(4) DEFAULT NULL,
    `condition` int(4) DEFAULT NULL,
    `grade` int(4) DEFAULT NULL,
    `sqft_above` float DEFAULT NULL,
    `sqft_basement` float DEFAULT NULL,
    `yr_built` int(11) DEFAULT NULL,
    `yr_renovated` int(11) DEFAULT NULL,
    `zip_code` int(11) DEFAULT NULL,
    `lat` float DEFAULT NULL,
    `lon` float DEFAULT NULL,
    `sqft_living15` float DEFAULT NULL,
    `sqft_lot15` float DEFAULT NULL,
    `price` float DEFAULT NULL,
    PRIMARY KEY (`id`)
    );

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
0 rows affected.
0 rows affected.

[]

# 3.

In [14]:
%%sql
SHOW VARIABLES LIKE 'local_infile'; -- This query would show you the status of the variable ‘local_infile’. If it is off, use the next command, otherwise you should be good to go
SET GLOBAL local_infile = 1;
SHOW VARIABLES LIKE 'local_infile';
SET GLOBAL local_infile = 1;
load data local infile 'regression_data.csv'
into table house_price_data
fields terminated by ',';

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.
0 rows affected.
1 rows affected.
0 rows affected.
5469 rows affected.

[]

# 4.

In [15]:
%%sql
select * from house_price_data
limit 2;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
2 rows affected.

[(1000102, '0000-00-00', 6, 3.0, 2400.0, 9373.0, 2, 0, 0, 3, 7, 2400.0, 0.0, 1991, 0, 98002, 47.3262, -122.214, 2060.0, 7316.0, 280000.0),
 (1200019, datetime.date(5, 8, 14), 4, 1.75, 2060.0, 26036.0, 1, 0, 0, 4, 8, 1160.0, 900.0, 1947, 0, 98166, 47.4444, -122.351, 2590.0, 21891.0, 647500.0)]

# 5.

In [16]:
%%sql
ALTER TABLE house_price_data
DROP COLUMN date;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
0 rows affected.

[]

In [17]:
%%sql
select * from house_price_data
limit 2;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
2 rows affected.

[(1000102, 6, 3.0, 2400.0, 9373.0, 2, 0, 0, 3, 7, 2400.0, 0.0, 1991, 0, 98002, 47.3262, -122.214, 2060.0, 7316.0, 280000.0),
 (1200019, 4, 1.75, 2060.0, 26036.0, 1, 0, 0, 4, 8, 1160.0, 900.0, 1947, 0, 98166, 47.4444, -122.351, 2590.0, 21891.0, 647500.0)]

# 6.

In [18]:
%%sql
select count(*) from house_price_data;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(5469,)]

# 7.

In [19]:
%%sql
select count(distinct(bathrooms))
from house_price_data;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(26,)]

In [20]:
%%sql
select count(distinct(floors))
from house_price_data;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(4,)]

In [21]:
%%sql
select count(distinct(hpd.condition))
from house_price_data hpd;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(5,)]

In [22]:
%%sql
select count(distinct(grade))
from house_price_data;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(10,)]

# 8.

In [23]:
%%sql
select * from house_price_data
order by price desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
10 rows affected.

[(1247600105, 5, 5.25, 8010.0, 45517.0, 2, 1, 4, 3, 12, 5990.0, 2020.0, 1999, 0, 98033, 47.6767, -122.211, 3430.0, 26788.0, 5110000.0),
 (1924059029, 5, 6.75, 9640.0, 13068.0, 1, 1, 4, 3, 12, 4820.0, 4820.0, 1983, 2009, 98040, 47.557, -122.21, 3270.0, 10454.0, 4670000.0),
 (853200010, 5, 5.5, 7050.0, 42840.0, 1, 0, 2, 4, 13, 4320.0, 2730.0, 1978, 0, 98004, 47.6229, -122.22, 5070.0, 20570.0, 3800000.0),
 (1118000320, 4, 4.0, 4260.0, 11765.0, 2, 0, 0, 3, 11, 3280.0, 980.0, 1939, 2010, 98112, 47.638, -122.288, 4260.0, 10408.0, 3400000.0),
 (1346300150, 8, 4.0, 7710.0, 11750.0, 4, 0, 0, 5, 12, 6090.0, 1620.0, 1904, 0, 98112, 47.6263, -122.314, 4210.0, 8325.0, 3300000.0),
 (1068000375, 6, 5.0, 7100.0, 18200.0, 3, 0, 0, 3, 13, 5240.0, 1860.0, 1933, 2002, 98199, 47.6427, -122.408, 3130.0, 6477.0, 3200000.0),
 (251500080, 4, 4.0, 4810.0, 18851.0, 2, 0, 3, 3, 11, 4810.0, 0.0, 2007, 0, 98004, 47.6364, -122.214, 3970.0, 19929.0, 3200000.0),
 (624069108, 4, 3.25, 7000.0, 28206.0, 1, 1, 4, 4, 12, 3500.0, 3500.0, 1991, 0, 98075, 47.5928, -122.086, 4913.0, 14663.0, 3200000.0),
 (333100295, 3, 3.5, 4490.0, 56609.0, 2, 1, 4, 3, 12, 4490.0, 0.0, 1993, 0, 98034, 47.6997, -122.24, 2710.0, 51330.0, 3120000.0),
 (1732800780, 5, 3.0, 4150.0, 7500.0, 3, 0, 4, 5, 11, 3510.0, 640.0, 1909, 0, 98119, 47.6303, -122.362, 2250.0, 4050.0, 3070000.0)]

# 9.

In [24]:
%%sql
select avg(price) from house_price_data;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(551841.4909489852,)]

# 10.

In [25]:
%%sql
select bedrooms,avg(price) as avg from house_price_data 
group by bedrooms
order by bedrooms asc;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
11 rows affected.

[(1, 322793.375),
 (2, 397099.23357664235),
 (3, 472249.5753262159),
 (4, 664058.2586412396),
 (5, 807996.3129411765),
 (6, 756072.0),
 (7, 920773.0),
 (8, 1882000.0),
 (9, 524999.5),
 (10, 1150000.0),
 (11, 520000.0)]

In [26]:
%%sql
select bedrooms, avg(sqft_living) as averagesSQFT from house_price_data 
group by bedrooms
order by bedrooms asc;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
11 rows affected.

[(1, 877.03125),
 (2, 1231.5503649635036),
 (3, 1822.5911427441677),
 (4, 2616.5),
 (5, 3148.2776470588237),
 (6, 3380.1714285714284),
 (7, 4854.444444444444),
 (8, 4664.0),
 (9, 3940.0),
 (10, 4590.0),
 (11, 3000.0)]

In [27]:
%%sql
select waterfront, avg(price) as avgPrice from house_price_data 
group by waterfront
;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
2 rows affected.

[(0, 542137.2582073036), (1, 1671338.2978723405)]

In [28]:
%%sql
select hpd.condition, avg(price) from house_price_data hpd
group by hpd.condition;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
5 rows affected.

[(3, 558567.3428165007),
 (4, 523170.3975409836),
 (5, 630212.9768518518),
 (2, 296114.1538461539),
 (1, 180916.66666666666)]

# 11.

In [21]:
%%sql
select * from house_price_data hpd
where bedrooms = 3 or bedrooms = 4 and floors = 1 and waterfront = 0 and bathrooms > 3 and grade > 4 and price < 300000 and hpd.condition > 2
limit 10;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
10 rows affected.

[(1200021, 3, 1.0, 1460.0, 43000.0, 1, 0, 0, 3, 7, 1460.0, 0.0, 1952, 0, 98166, 47.4434, -122.347, 2250.0, 20023.0, 400000.0),
 (2800031, 3, 1.0, 1430.0, 7599.0, 2, 0, 0, 4, 6, 1010.0, 420.0, 1930, 0, 98168, 47.4783, -122.265, 1290.0, 10320.0, 235000.0),
 (6200017, 3, 1.0, 1340.0, 21336.0, 2, 0, 0, 4, 5, 1340.0, 0.0, 1945, 0, 98032, 47.4023, -122.273, 1340.0, 37703.0, 281000.0),
 (7600057, 3, 2.0, 1410.0, 2700.0, 2, 0, 0, 4, 7, 1410.0, 0.0, 1902, 0, 98122, 47.6029, -122.302, 1750.0, 4000.0, 520000.0),
 (7600065, 3, 2.25, 1530.0, 1245.0, 2, 0, 0, 3, 9, 1050.0, 480.0, 2014, 0, 98122, 47.6018, -122.297, 1530.0, 2307.0, 465000.0),
 (11200070, 3, 2.5, 1530.0, 3296.0, 2, 0, 0, 3, 8, 1530.0, 0.0, 1998, 0, 98007, 47.6181, -122.138, 1530.0, 4099.0, 570000.0),
 (11200290, 3, 2.5, 1530.0, 3464.0, 2, 0, 0, 3, 8, 1530.0, 0.0, 1998, 0, 98007, 47.6179, -122.141, 1530.0, 3446.0, 546000.0),
 (11200400, 3, 2.5, 1910.0, 4488.0, 2, 0, 0, 3, 8, 1910.0, 0.0, 1998, 0, 98007, 47.6176, -122.14, 1530.0, 3696.0, 617000.0),
 (11300120, 3, 2.5, 3350.0, 4007.0, 2, 0, 0, 3, 8, 2550.0, 800.0, 2005, 0, 98034, 47.7277, -122.207, 2340.0, 4167.0, 635000.0),
 (11500240, 3, 2.5, 2870.0, 13695.0, 2, 0, 0, 3, 10, 2870.0, 0.0, 1991, 0, 98052, 47.6944, -122.102, 2840.0, 8472.0, 872750.0)]

# 12.

In [22]:
%%sql
select * from house_price_data
where price > 2*(select avg(price) from house_price_data)
limit 10;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
10 rows affected.

[(31000165, 5, 3.5, 3620.0, 7821.0, 2, 0, 2, 3, 10, 2790.0, 830.0, 1958, 2010, 98040, 47.5738, -122.215, 2690.0, 9757.0, 1490000.0),
 (46100204, 5, 3.0, 3300.0, 33474.0, 1, 0, 3, 3, 9, 1870.0, 1430.0, 1957, 1991, 98040, 47.5673, -122.21, 3836.0, 20953.0, 1510000.0),
 (46100350, 5, 3.5, 5000.0, 26540.0, 2, 0, 3, 3, 10, 3410.0, 1590.0, 2008, 0, 98040, 47.5665, -122.21, 3360.0, 17398.0, 1730000.0),
 (46100504, 4, 3.75, 4100.0, 22798.0, 2, 0, 3, 5, 11, 2540.0, 1560.0, 1934, 1979, 98040, 47.5648, -122.21, 3880.0, 18730.0, 2030000.0),
 (98000130, 4, 5.0, 4630.0, 24054.0, 2, 0, 3, 3, 11, 4630.0, 0.0, 2005, 0, 98075, 47.587, -121.966, 4630.0, 17584.0, 1430000.0),
 (98000150, 4, 4.0, 4930.0, 22093.0, 2, 0, 3, 3, 12, 4930.0, 0.0, 2004, 0, 98075, 47.5874, -121.965, 4630.0, 18889.0, 1470000.0),
 (98000750, 5, 3.75, 4220.0, 15959.0, 2, 0, 0, 3, 11, 4220.0, 0.0, 2004, 0, 98075, 47.5869, -121.967, 4630.0, 16531.0, 1170000.0),
 (98001070, 5, 4.25, 4610.0, 13252.0, 2, 0, 4, 3, 11, 4610.0, 0.0, 2004, 0, 98075, 47.5878, -121.969, 4400.0, 15154.0, 1170000.0),
 (98300230, 4, 4.0, 4620.0, 130208.0, 2, 0, 0, 3, 10, 4620.0, 0.0, 2014, 0, 98024, 47.5885, -121.939, 4620.0, 131007.0, 1460000.0),
 (125069038, 4, 3.75, 5150.0, 453895.0, 2, 0, 3, 3, 11, 4360.0, 790.0, 1997, 0, 98053, 47.6795, -121.991, 2500.0, 215186.0, 2140000.0)]

# 13.

In [28]:
%%sql
drop view if Houses_with_higher_than_double_average_price;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'Houses_with_higher_than_double_average_price' at line 1")
[SQL: drop view if Houses_with_higher_than_double_average_price;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [29]:
%%sql
create view Houses_with_higher_than_double_average_price as (select * from house_price_data where price > 2*(select avg(price) from house_price_data)
limit 10);

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
0 rows affected.

[]

# 14.

In [24]:
%%sql
select bedrooms, avg(price) from house_price_data
where bedrooms = 3 or bedrooms = 4
group by bedrooms;

# 15.

In [25]:
%%sql
select count(distinct(zip_code)) from house_price_data;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
1 rows affected.

[(69,)]

# 16.

In [26]:
%%sql
select * from house_price_data
where yr_renovated != 0
limit 10;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
10 rows affected.

[(3600057, 4, 2.0, 1650.0, 3504.0, 1, 0, 0, 3, 7, 760.0, 890.0, 1951, 2013, 98144, 47.5803, -122.294, 1480.0, 3504.0, 402500.0),
 (9000025, 2, 1.0, 1420.0, 4635.0, 2, 0, 0, 4, 7, 1420.0, 0.0, 1941, 1973, 98115, 47.68, -122.304, 1810.0, 4635.0, 496000.0),
 (16000200, 3, 2.25, 1640.0, 4420.0, 2, 0, 0, 4, 7, 1640.0, 0.0, 1918, 1983, 98002, 47.311, -122.21, 1230.0, 6632.0, 250000.0),
 (31000165, 5, 3.5, 3620.0, 7821.0, 2, 0, 2, 3, 10, 2790.0, 830.0, 1958, 2010, 98040, 47.5738, -122.215, 2690.0, 9757.0, 1490000.0),
 (46100204, 5, 3.0, 3300.0, 33474.0, 1, 0, 3, 3, 9, 1870.0, 1430.0, 1957, 1991, 98040, 47.5673, -122.21, 3836.0, 20953.0, 1510000.0),
 (46100504, 4, 3.75, 4100.0, 22798.0, 2, 0, 3, 5, 11, 2540.0, 1560.0, 1934, 1979, 98040, 47.5648, -122.21, 3880.0, 18730.0, 2030000.0),
 (65000260, 3, 2.5, 3370.0, 6550.0, 2, 0, 2, 4, 8, 2840.0, 530.0, 1912, 2001, 98126, 47.5442, -122.38, 1500.0, 6550.0, 830000.0),
 (66000265, 2, 1.0, 820.0, 6550.0, 1, 0, 0, 3, 7, 820.0, 0.0, 1949, 2012, 98126, 47.5478, -122.381, 1640.0, 6550.0, 370000.0),
 (88000790, 3, 1.0, 1170.0, 9730.0, 1, 0, 0, 3, 7, 1170.0, 0.0, 1968, 1986, 98055, 47.4562, -122.196, 1680.0, 10125.0, 252000.0),
 (91000135, 4, 1.5, 2060.0, 4000.0, 2, 0, 2, 3, 7, 1580.0, 480.0, 1920, 1990, 98103, 47.6857, -122.353, 1160.0, 4000.0, 750000.0)]

# 17.

In [27]:
%%sql
select * from house_price_data with index(11)
;

 * mysql+pymysql://root:***@localhost/sakila?charset=utf8&local_infile=1
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'with index(11)' at line 1")
[SQL: select * from house_price_data with index(11)
;]
(Background on this error at: https://sqlalche.me/e/14/f405)